Engenharia de Software/Projeto - Ruby/MeuBlog/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all  # Recupera todos os posts do banco de dados